<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Melt---make-a-wide-table-narrow" data-toc-modified-id="Melt---make-a-wide-table-narrow-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Melt - make a wide table narrow</a></span></li><li><span><a href="#Stack" data-toc-modified-id="Stack-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Stack</a></span></li><li><span><a href="#Pivot" data-toc-modified-id="Pivot-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Pivot</a></span></li><li><span><a href="#Exercise---10-minutes" data-toc-modified-id="Exercise---10-minutes-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Exercise - 10 minutes</a></span></li></ul></div>

In [7]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib as mpl
import seaborn as sns
from numpy.random import randn

In [8]:
acs =    pd.read_csv('https://raw.githubusercontent.com/jimcody2014/python_data/refs/heads/main/ga_a.csv')
places = pd.read_csv('https://raw.githubusercontent.com/jimcody2014/python_data/refs/heads/main/ga_p.csv')

print(acs.shape)
print(places.shape)

(159, 13)
(159, 19)

In [9]:
places.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 159 entries, 0 to 158
Data columns (total 19 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       159 non-null    int64
 1   StateAbbr        159 non-null    object
 2   StateDesc        159 non-null    object
 3   CountyName       159 non-null    object
 4   CountyFIPS       159 non-null    int64
 5   TotalPopulation  159 non-null    int64
 6   harthritis       159 non-null    float64
 7   hasthma          159 non-null    float64
 8   hbphigh          159 non-null    float64
 9   hcancer          159 non-null    float64
 10  hhighchol        159 non-null    float64
 11  hkidney          159 non-null    float64
 12  hcopd            159 non-null    float64
 13  hchd             159 non-null    float64
 14  hdiabetes        159 non-null    float64
 15  hmhlth           159 non-null    float64
 16  hphlth           159 non-null    float64
 17  hteethlost       159 non-null    float64
 18  hstroke          159 non-null    float64
dtypes: float64(13), int64(3), object(3)
memory usage: 23.7+ KB

In [10]:
places = places.drop('Unnamed: 0',axis=1) 
places.head()

,StateAbbr,StateDesc,CountyName,CountyFIPS,TotalPopulation,harthritis,hasthma,hbphigh,hcancer,hhighchol,hkidney,hcopd,hchd,hdiabetes,hmhlth,hphlth,hteethlost,hstroke
0,GA,Georgia,Appling,13001,18507,32.2,10.5,39.0,7.4,37.8,4.1,11.8,10.0,16.3,16.7,18.2,24.6,5.1
1,GA,Georgia,Atkinson,13003,8297,29.0,10.7,38.3,6.5,37.3,4.1,11.8,9.8,16.8,17.7,18.8,28.1,5.1
2,GA,Georgia,Bacon,13005,11185,30.5,10.4,37.1,7.1,36.2,3.8,11.3,9.3,15.2,16.8,17.6,22.9,4.8
3,GA,Georgia,Baker,13007,3092,32.6,10.3,44.2,8.0,38.3,4.3,10.4,9.7,18.2,14.3,16.8,21.3,5.6
4,GA,Georgia,Baldwin,13009,44823,27.2,10.5,38.4,6.3,34.8,3.6,9.1,8.1,14.9,15.9,15.0,20.8,4.5

In [11]:
df1 = {
    'fruit':['apples','pears','oranges','mangos'],
    'Jan':[100,87,45,56],
    'Feb':[78,43,78,89],
    'Mar':[34,67,54,98],
    'Apr':[102,98,105,154],
    'May':[1,2,3,4],
    'Jun':[10,20,40,70]
}
d1 = pd.DataFrame(df1)
d1

     fruit  Jan  Feb  Mar  Apr  May  Jun
0   apples  100   78   34  102    1   10
1    pears   87   43   67   98    2   20
2  oranges   45   78   54  105    3   40
3   mangos   56   89   98  154    4   70

# Melt - make a wide table narrow

In [12]:
# id_vars - 
# var_name - 
# value_name - 

d1.melt(id_vars=['fruit'])

      fruit variable  value
0    apples      Jan    100
1     pears      Jan     87
2   oranges      Jan     45
3    mangos      Jan     56
4    apples      Feb     78
5     pears      Feb     43
6   oranges      Feb     78
7    mangos      Feb     89
8    apples      Mar     34
9     pears      Mar     67
10  oranges      Mar     54
11   mangos      Mar     98
12   apples      Apr    102
13    pears      Apr     98
14  oranges      Apr    105
15   mangos      Apr    154
16   apples      May      1
17    pears      May      2
18  oranges      May      3
19   mangos      May      4
20   apples      Jun     10
21    pears      Jun     20
22  oranges      Jun     40
23   mangos      Jun     70

In [13]:
#d1.melt(id_vars=['fruit'], var_name = 'Month', value_name = 'Picked')
d1.melt(id_vars=['fruit'], var_name = 'Month', value_name = 'Picked').sort_values(by = 'fruit')
#d1.melt(id_vars=['fruit'], var_name = 'Month', value_name = 'Picked').sort_values(by = ['fruit', 'Month'])

      fruit Month  Picked
0    apples   Jan     100
20   apples   Jun      10
16   apples   May       1
4    apples   Feb      78
12   apples   Apr     102
8    apples   Mar      34
19   mangos   May       4
15   mangos   Apr     154
11   mangos   Mar      98
3    mangos   Jan      56
7    mangos   Feb      89
23   mangos   Jun      70
10  oranges   Mar      54
22  oranges   Jun      40
6   oranges   Feb      78
14  oranges   Apr     105
18  oranges   May       3
2   oranges   Jan      45
9     pears   Mar      67
13    pears   Apr      98
5     pears   Feb      43
17    pears   May       2
1     pears   Jan      87
21    pears   Jun      20

# Stack

In [14]:
d1

     fruit  Jan  Feb  Mar  Apr  May  Jun
0   apples  100   78   34  102    1   10
1    pears   87   43   67   98    2   20
2  oranges   45   78   54  105    3   40
3   mangos   56   89   98  154    4   70

In [15]:
d1.stack()

0  fruit     apples
   Jan          100
   Feb           78
   Mar           34
   Apr          102
   May            1
   Jun           10
1  fruit      pears
   Jan           87
   Feb           43
   Mar           67
   Apr           98
   May            2
   Jun           20
2  fruit    oranges
   Jan           45
   Feb           78
   Mar           54
   Apr          105
   May            3
   Jun           40
3  fruit     mangos
   Jan           56
   Feb           89
   Mar           98
   Apr          154
   May            4
   Jun           70
dtype: object

In [16]:
fruit = ['apples','pears','oranges','mangos']
df2 = {
 #   'fruit':['apples','pears','oranges','mangos'],
    'Jan':[100,87,45,56],
    'Feb':[78,43,78,89],
    'Mar':[34,67,54,98],
    'Apr':[102,98,105,154],
    'May':[1,2,3,4],
    'Jun':[10,20,40,70]
}
d2 = pd.DataFrame(df2, index = fruit)
d2

         Jan  Feb  Mar  Apr  May  Jun
apples   100   78   34  102    1   10
pears     87   43   67   98    2   20
oranges   45   78   54  105    3   40
mangos    56   89   98  154    4   70

In [17]:
d2.stack()

apples   Jan    100
         Feb     78
         Mar     34
         Apr    102
         May      1
         Jun     10
pears    Jan     87
         Feb     43
         Mar     67
         Apr     98
         May      2
         Jun     20
oranges  Jan     45
         Feb     78
         Mar     54
         Apr    105
         May      3
         Jun     40
mangos   Jan     56
         Feb     89
         Mar     98
         Apr    154
         May      4
         Jun     70
dtype: int64

In [18]:
fruit = ['apples','pears','apple','pears']
state = ['MA','MA','VT','VT']
df2 = {
 #   'fruit':['apples','pears','oranges','mangos'],
    'Jan':[100,87,45,56],
    'Feb':[78,43,78,89],
    'Mar':[34,67,54,98],
    'Apr':[102,98,105,154],
    'May':[1,2,3,4],
    'Jun':[10,20,40,70]
}
d2 = pd.DataFrame(df2, index = [state,fruit])
d2

           Jan  Feb  Mar  Apr  May  Jun
MA apples  100   78   34  102    1   10
   pears    87   43   67   98    2   20
VT apple    45   78   54  105    3   40
   pears    56   89   98  154    4   70

In [19]:
d2_stacked = d2.stack()
d2_stacked

MA  apples  Jan    100
            Feb     78
            Mar     34
            Apr    102
            May      1
            Jun     10
    pears   Jan     87
            Feb     43
            Mar     67
            Apr     98
            May      2
            Jun     20
VT  apple   Jan     45
            Feb     78
            Mar     54
            Apr    105
            May      3
            Jun     40
    pears   Jan     56
            Feb     89
            Mar     98
            Apr    154
            May      4
            Jun     70
dtype: int64

In [20]:
d2_stacked.unstack()

           Jan  Feb  Mar  Apr  May  Jun
MA apples  100   78   34  102    1   10
   pears    87   43   67   98    2   20
VT apple    45   78   54  105    3   40
   pears    56   89   98  154    4   70

# Pivot

In [21]:
df5 = {
    'state':['MA','MA','VT','VT'],
    'location':['bolton','berlin','boyleston','berlin'],
    'apples': [3, 2, 0, 1], 
    'pears': [0, 3, 7, 2]
}
d5 = pd.DataFrame(df5)
d5

  state   location  apples  pears
0    MA     bolton       3      0
1    MA     berlin       2      3
2    VT  boyleston       0      7
3    VT     berlin       1      2

In [22]:
d5.pivot(index='state', columns = 'location')

         apples                   pears
location berlin bolton boyleston berlin bolton boyleston
state
MA          2.0    3.0       NaN    3.0    0.0       NaN
VT          1.0    NaN       0.0    2.0    NaN       7.0

In [23]:
d5.pivot(index='state', columns = 'location', values = 'apples')

location  berlin  bolton  boyleston
state
MA           2.0     3.0        NaN
VT           1.0     NaN        0.0

# Exercise - 10 minutes

In [24]:
places.head()

,StateAbbr,StateDesc,CountyName,CountyFIPS,TotalPopulation,harthritis,hasthma,hbphigh,hcancer,hhighchol,hkidney,hcopd,hchd,hdiabetes,hmhlth,hphlth,hteethlost,hstroke
0,GA,Georgia,Appling,13001,18507,32.2,10.5,39.0,7.4,37.8,4.1,11.8,10.0,16.3,16.7,18.2,24.6,5.1
1,GA,Georgia,Atkinson,13003,8297,29.0,10.7,38.3,6.5,37.3,4.1,11.8,9.8,16.8,17.7,18.8,28.1,5.1
2,GA,Georgia,Bacon,13005,11185,30.5,10.4,37.1,7.1,36.2,3.8,11.3,9.3,15.2,16.8,17.6,22.9,4.8
3,GA,Georgia,Baker,13007,3092,32.6,10.3,44.2,8.0,38.3,4.3,10.4,9.7,18.2,14.3,16.8,21.3,5.6
4,GA,Georgia,Baldwin,13009,44823,27.2,10.5,38.4,6.3,34.8,3.6,9.1,8.1,14.9,15.9,15.0,20.8,4.5

In [25]:
# The places dataset has a separate column for each healthy outcome measure.
# Melt the table so that they are all in one column with their associated values in a separate column.
#d1.melt(id_vars=['fruit'], var_name = 'Month', value_name = 'Picked').sort_values(by = ['fruit', 'Month'])

places_long = places.melt(id_vars=['StateAbbr','StateDesc','CountyName','CountyFIPS','TotalPopulation'], 
                          var_name = 'Outcome', value_name='pct').sort_values(by = 'CountyFIPS')
places_long.head(20)

,StateAbbr,StateDesc,CountyName,CountyFIPS,TotalPopulation,Outcome,pct
0,GA,Georgia,Appling,13001,18507,harthritis,32.2
954,GA,Georgia,Appling,13001,18507,hcopd,11.8
1113,GA,Georgia,Appling,13001,18507,hchd,10.0
1590,GA,Georgia,Appling,13001,18507,hphlth,18.2
477,GA,Georgia,Appling,13001,18507,hcancer,7.4
1749,GA,Georgia,Appling,13001,18507,hteethlost,24.6
159,GA,Georgia,Appling,13001,18507,hasthma,10.5
1908,GA,Georgia,Appling,13001,18507,hstroke,5.1
795,GA,Georgia,Appling,13001,18507,hkidney,4.1
1272,GA,Georgia,Appling,13001,18507,hdiabetes,16.3
318,GA,Georgia,Appling,13001,18507,hbphigh,39.0
636,GA,Georgia,Appling,13001,18507,hhighchol,37.8
1431,GA,Georgia,Appling,13001,18507,hmhlth,16.7
1114,GA,Georgia,Atkinson,13003,8297,hchd,9.8
478,GA,Georgia,Atkinson,13003,8297,hcancer,6.5
1591,GA,Georgia,Atkinson,13003,8297,hphlth,18.8
160,GA,Georgia,Atkinson,13003,8297,hasthma,10.7
637,GA,Georgia,Atkinson,13003,8297,hhighchol,37.3
1909,GA,Georgia,Atkinson,13003,8297,hstroke,5.1
1,GA,Georgia,Atkinson,13003,8297,harthritis,29.0

In [26]:
places_long.shape

(2067, 7)

In [27]:
# This works but creates a potential problem.  What do you think it is?

In [28]:
# Making sure TotalPopulation cannot be accidentally summarized
places_long = places_long.drop('TotalPopulation',axis=1)

In [29]:
places_long.shape

(2067, 6)